
** Script.py

#+begin_src python :results output
  import pandas as pd

  # Read de csv data as a DataFrame
  df = pd.read_csv('Dry_Bean.csv')

  # Remove null and na values
  df.dropna()

  # Print the DataFrame head
  print(df.head())

  # Extract the numerical columns
  data_matrix = df.drop(columns='Class')

  # Extract the classes
  classes = df['Class']

  # Print data_matrix
  print(data_matrix)

#+end_src

#+RESULTS:
#+begin_example
    Area  Perimeter  MajorAxisLength  ...  ShapeFactor3  ShapeFactor4  Class
0  28395    610.291       208.178117  ...      0.834222      0.998724  SEKER
1  28734    638.018       200.524796  ...      0.909851      0.998430  SEKER
2  29380    624.110       212.826130  ...      0.825871      0.999066  SEKER
3  30008    645.884       210.557999  ...      0.861794      0.994199  SEKER
4  30140    620.134       201.847882  ...      0.941900      0.999166  SEKER

[5 rows x 17 columns]
        Area  Perimeter  ...  ShapeFactor3  ShapeFactor4
0      28395    610.291  ...      0.834222      0.998724
1      28734    638.018  ...      0.909851      0.998430
2      29380    624.110  ...      0.825871      0.999066
3      30008    645.884  ...      0.861794      0.994199
4      30140    620.134  ...      0.941900      0.999166
...      ...        ...  ...           ...           ...
13606  42097    759.696  ...      0.642988      0.998385
13607  42101    757.499  ...      0.676099      0.998219
13608  42139    759.321  ...      0.676884      0.996767
13609  42147    763.779  ...      0.668237      0.995222
13610  42159    772.237  ...      0.616221      0.998180

[13611 rows x 16 columns]
#+end_example

** Script.py

#+begin_src python :results output
  import numpy as np
  import pandas as pd
  import matplotlib.pyplot as plt
  import seaborn as sns

  # Read de csv data as a DataFrame
  df = pd.read_csv('Dry_Bean.csv')

  # Remove null and na values
  df.dropna()

  # Extract the numerical columns
  data_matrix = df.drop(columns='Class')

  # Extract the classes
  classes = df['Class']

  # Use the .corr() method on data_matrix to get the correlation matrix
  correlation_matrix = data_matrix.corr()

  # Heatmap code:
  red_blue = sns.diverging_palette(220, 20, as_cmap=True)
  sns.heatmap(correlation_matrix, vmin = -1, vmax = 1, cmap = red_blue)
  plt.show()

  # Perform decomposition using np.linalg.eig
  eigenvalues, eigenvectors = np.linalg.eig(correlation_matrix)

  #print('eigenvectors: ')
  #print(eigenvectors)

  print('eigenvalues: ')
  print(eigenvalues)

  # Proportion of information explained
  info_prop = eigenvalues / eigenvalues.sum()
  print('info_prop: ')
  print(info_prop)

  # Plot the relative proportions
  plt.plot(np.arange(1, len(info_prop) + 1), info_prop, 'bo-')
  plt.show()

  # Calculate the cumulative sum of info_prop
  cum_info_prop = np.cumsum(info_prop)

  # Plot cum_info_prop using matplotlib
  plt.plot(np.arange(1,len(info_prop)+1),
         cum_info_prop,
         'bo-')
  plt.hlines(y=.95, xmin=0, xmax=15)
  plt.vlines(x=4, ymin=0, ymax=1)
  plt.show()

#+end_src

#+RESULTS:
#+begin_example
eigenvalues:
[8.87463018e+00 4.22895571e+00 1.28105028e+00 8.18252847e-01
 4.38286865e-01 1.83961749e-01 1.11624116e-01 5.20132000e-02
 8.26026072e-03 1.45388993e-03 1.05418870e-03 2.93982938e-04
 1.48794566e-04 1.00102669e-05 1.78479175e-06 2.14611337e-06]
info_prop:
[5.54664386e-01 2.64309732e-01 8.00656422e-02 5.11408029e-02
 2.73929290e-02 1.14976093e-02 6.97650724e-03 3.25082500e-03
 5.16266295e-04 9.08681206e-05 6.58867938e-05 1.83739336e-05
 9.29966038e-06 6.25641679e-07 1.11549485e-07 1.34132086e-07]
#+end_example

** Script.py

#+begin_src python :results output
  import numpy as np
  import pandas as pd
  from sklearn.decomposition import PCA

  data_matrix = pd.read_csv('data_matrix.csv')

  # 1. Standardize the data matrix
  mean = data_matrix.mean(axis=0)
  sttd = data_matrix.std(axis=0)
  data_matrix_standardized = (data_matrix - mean) / sttd
  print(data_matrix_standardized.head())

  # 2. Find the principal components
  pca = PCA()
  components = pca.fit(data_matrix_standardized).components_
  components = pd.DataFrame(components).transpose()
  components.index = data_matrix.columns
  print(components)

  # 3. Calculate the variance/info ratios
  var_ratio = pca.explained_variance_ratio_
  var_ratio = pd.DataFrame(var_ratio).transpose()
  print(var_ratio)

#+end_src

#+RESULTS:
#+begin_example
       Area  Perimeter  ...  ShapeFactor3  ShapeFactor4
0 -0.840718  -1.143277  ...      1.925653      0.838340
1 -0.829157  -1.013887  ...      2.689603      0.771110
2 -0.807128  -1.078789  ...      1.841288      0.916721
3 -0.785712  -0.977179  ...      2.204169     -0.197978
4 -0.781210  -1.097344  ...      3.013352      0.939605

[5 rows x 16 columns]
                       0         1         2   ...        13        14        15
Area             0.282458  0.245882 -0.061447  ... -0.655728  0.133190  0.231436
Perimeter        0.310891  0.179303 -0.018853  ... -0.081390  0.012658  0.014614
MajorAxisLength  0.325824  0.100757 -0.084692  ...  0.186251  0.174432  0.346019
MinorAxisLength  0.236199  0.343461  0.007500  ...  0.183096  0.155445  0.331749
AspectRation     0.229298 -0.330844 -0.169058  ... -0.026666  0.102810 -0.123576
Eccentricity     0.231526 -0.319434 -0.163042  ... -0.000046 -0.042306  0.014793
ConvexArea       0.283200  0.244630 -0.053649  ...  0.648622 -0.130974 -0.224753
EquivDiameter    0.297484  0.222802 -0.049914  ... -0.266409 -0.332488 -0.675589
Extent          -0.059808  0.220619 -0.085258  ...  0.000057 -0.000001 -0.000005
Solidity        -0.143016  0.103322 -0.738670  ...  0.007671 -0.001387 -0.002115
roundness       -0.248165  0.214805 -0.163325  ... -0.014669  0.002375  0.001894
Compactness     -0.238378  0.328914  0.149701  ... -0.002026  0.652516 -0.372516
ShapeFactor1    -0.221319 -0.332549 -0.032623  ... -0.004011 -0.005468 -0.011285
ShapeFactor2    -0.314625  0.129419  0.120077  ...  0.018504  0.005545  0.014668
ShapeFactor3    -0.238983  0.327522  0.149570  ... -0.046184 -0.601335  0.234065
ShapeFactor4    -0.198009  0.100061 -0.536903  ...  0.004297  0.000616  0.010377

[16 rows x 16 columns]
         0        1         2   ...            13            14            15
0  0.554664  0.26431  0.080066  ...  6.256417e-07  1.341321e-07  1.115495e-07

[1 rows x 16 columns]
#+end_example

** Script.py

#+begin_src python :results output
  import numpy as np
  import pandas as pd
  from sklearn.decomposition import PCA
  import matplotlib.pyplot as plt
  import seaborn as sns

  data_matrix_standardized = pd.read_csv('./data_matrix_standardized.csv')

  classes = pd.read_csv('./classes.csv')['Class']

  # 1. Transform the data into 4 new features using the first PCs
  pca = PCA(n_components=4)
  data_pcomp = pca.fit_transform(data_matrix_standardized)
  data_pcomp = pd.DataFrame(data_pcomp)
  data_pcomp.columns = ['PC1', 'PC2', 'PC3', 'PC4']
  print(data_pcomp.head())

  # 2. Plot the first two principal components by the bean classes
  data_pcomp['bean_classes'] = classes
  sns.lmplot(x='PC1', y='PC2', data=data_pcomp, hue='bean_classes', fit_reg=False)
  plt.show()

#+end_src

#+RESULTS:
:         PC1       PC2       PC3       PC4
: 0 -4.981378  1.824630  0.748993 -0.390797
: 1 -5.436593  2.932257  2.182294 -0.431944
: 2 -4.757913  1.826817  0.514019 -0.125849
: 3 -4.300383  2.003587  3.554316  0.082961
: 4 -6.349107  4.088055  1.179156 -0.830327

** Script.py

#+begin_src python :results output
  import pandas as pd
  from sklearn.decomposition import PCA
  from sklearn.svm import LinearSVC
  from sklearn.model_selection import train_test_split

  data_matrix_standardized = pd.read_csv('./data_matrix_standardized.csv')
  classes = pd.read_csv('./classes.csv')

  # We will use the classes as y
  y = classes.Class.astype('category').cat.codes

  # Get principal components with 4 features and save as X
  pca_1 = PCA(n_components=4)
  X = pca_1.fit_transform(data_matrix_standardized)

  # Split the data into 33% testing and the rest training
  X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

  # Create a linear support vector classifier
  svc_1 = LinearSVC(random_state=0, tol=1e-5, dual='auto')
  svc_1.fit(X_train, y_train)

  # Generate a score for the testing data
  score_1 = svc_1.score(X_test, y_test)
  print(f'Score for model with 4 PCA features: {score_1}')

  # Split the original data into 33% testing and the rest training
  X_train, X_test, y_train, y_test = train_test_split(data_matrix_standardized, y, test_size=0.33, random_state=42)

  # Create a Linear Support Vector Classifier
  svc_2 = LinearSVC(random_state=0, dual='auto')
  svc_2.fit(X_train, y_train)

  # Generate a score for the testing data
  score_2 = svc_2.score(X_test, y_test)
  print(f'Score for the model with original features: {score_2}')

#+end_src

#+RESULTS:
: Score for model with 4 PCA features: 0.8472840605520926
: Score for the model with original features: 0.9171861086375779

** Script.py

#+begin_src python :results output
  import numpy as np
  from sklearn import datasets
  import matplotlib.pyplot as plt

  # Download the data from sklearn's datasets
  faces = datasets.fetch_olivetti_faces()['data']

  # 1. Standardize the images using the mean and standard deviation
  faces_mean = faces.mean(axis=0)
  faces_std = faces.std(axis=0)
  faces_standardized = (faces - faces_mean) / faces_std

  # 2. Find the side length of a square image
  n_images, n_features = faces_standardized.shape
  side_length = int(np.sqrt(n_features))
  print(f'Number of features(pixels) per image: {n_features}')
  print(f'Square image side length: {side_length}')

  # Create an empty 10x8 plot
  fig = plt.figure(figsize=(10, 8))

  # Observe the first 15 images
  for i in range(15):
      # Create subplot, remove x and y ticks, and add title
      ax = fig.add_subplot(3, 5, i + 1, xticks=[], yticks=[])
      ax.set_title(f'Image of Face: #{i}')
      # Get an image from a row based on the current value of i
      face_image = faces_standardized[i]
      # Reshape this image into side_length x side_length
      face_image_reshaped = face_image.reshape(side_length, side_length)
      # Show the image
      ax.imshow(face_image_reshaped, cmap=plt.cm.bone)
  plt.show()

#+end_src

#+RESULTS:
: Number of features(pixels) per image: 4096
: Square image side length: 64

